In [2]:
# Reading Data with Pandas
# Reading CSV file

In [5]:
import csv

In [6]:
import pandas as pd

In [13]:
df = pd.read_csv('btc-market-price.csv')

df.head()
# Pandas automatically sets the first row as header if there's no header.

   2017-04-02 00:00:00  1099.169125
0  2017-04-03 00:00:00  1141.813000
1  2017-04-04 00:00:00  1141.600363
2  2017-04-05 00:00:00  1133.079314
3  2017-04-06 00:00:00  1196.307937
4  2017-04-07 00:00:00  1190.454250

In [14]:
df = pd.read_csv('btc-market-price.csv',
                header=None)
# Overwrite the first row behavior

In [15]:
df.head()

                     0            1
0  2017-04-02 00:00:00  1099.169125
1  2017-04-03 00:00:00  1141.813000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

In [18]:
df = pd.read_csv('btc-market-price.csv',
                 header=None,
                na_values=['', '?', '-'])
# Identify empty strings and null values

In [19]:
df.head()

                     0            1
0  2017-04-02 00:00:00  1099.169125
1  2017-04-03 00:00:00  1141.813000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

In [20]:
# Add column names
df = pd.read_csv('btc-market-price.csv',
                 header=None,
                na_values=['', '?', '-'],
                names=['Timestamp', 'Price'])

In [21]:
df.head()

             Timestamp        Price
0  2017-04-02 00:00:00  1099.169125
1  2017-04-03 00:00:00  1141.813000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Timestamp  365 non-null    object
 1   Price      365 non-null    float64
dtypes: float64(1), object(1)
memory usage: 5.8+ KB

In [29]:
df = pd.read_csv('btc-market-price.csv',
                 header=None,
                na_values=['', '?', '-'],
                names=['Timestamp', 'Price'],
                dtype={'Price': 'float'})

# Setting the dtype

In [30]:
df.head()

             Timestamp        Price
0  2017-04-02 00:00:00  1099.169125
1  2017-04-03 00:00:00  1141.813000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

In [31]:
df.dtypes

Timestamp     object
Price        float64
dtype: object

In [33]:
# Parse TImestamp colunm to Datetime objects using to_datetime method.

pd.to_datetime(df['Timestamp']).head()

0   2017-04-02
1   2017-04-03
2   2017-04-04
3   2017-04-05
4   2017-04-06
Name: Timestamp, dtype: datetime64[ns]

In [34]:
df['Timestamp'] = pd.to_datetime(df['Timestamp'])

In [35]:
df.head()

   Timestamp        Price
0 2017-04-02  1099.169125
1 2017-04-03  1141.813000
2 2017-04-04  1141.600363
3 2017-04-05  1133.079314
4 2017-04-06  1196.307937

In [36]:
df.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object

In [37]:
# Date parser using parse_dates parameter

df = pd.read_csv('btc-market-price.csv',
                 header=None,
                na_values=['', '?', '-'],
                names=['Timestamp', 'Price'],
                dtype={'Price': 'float'},
                parse_dates=[0])

In [38]:
df.head()

   Timestamp        Price
0 2017-04-02  1099.169125
1 2017-04-03  1141.813000
2 2017-04-04  1141.600363
3 2017-04-05  1133.079314
4 2017-04-06  1196.307937

In [39]:
df.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object

In [41]:
# Adding index to the data using index_col parameter

df = pd.read_csv('btc-market-price.csv',
                 header=None,
                na_values=['', '?', '-'],
                names=['Timestamp', 'Price'],
                dtype={'Price': 'float'},
                parse_dates=[0],
                index_col=[0])

In [42]:
df.head()

                  Price
Timestamp
2017-04-02  1099.169125
2017-04-03  1141.813000
2017-04-04  1141.600363
2017-04-05  1133.079314
2017-04-06  1196.307937

In [43]:
df.dtypes

Price    float64
dtype: object

In [46]:
# Reading another csv file, with more columns.

In [47]:
exam_df = pd.read_csv('exam_review.csv')

In [48]:
exam_df

                               first_name>last_name>age>math_score>french_score
Ray>Morley>18>"68     000">"75                                             000"
Melvin>Scott>24>77>83 NaN                                                   NaN
Amirah>Haley>22>92>67 NaN                                                   NaN
Gerard>Mills>19>"78   000">72                                               NaN
Amy>Grimes>23>91>81   NaN                                                   NaN

In [49]:
# Custom data delimeters using sep parameter

exam_df = pd.read_csv('exam_review.csv',
                     sep='>')

In [50]:
exam_df

  first_name last_name  age math_score french_score
0        Ray    Morley   18     68,000       75,000
1     Melvin     Scott   24         77           83
2     Amirah     Haley   22         92           67
3     Gerard     Mills   19     78,000           72
4        Amy    Grimes   23         91           81

In [51]:
# Custom numeric decimal and thousands character

exam_df = pd.read_csv('exam_review.csv',
                     sep='>')
exam_df

  first_name last_name  age math_score french_score
0        Ray    Morley   18     68,000       75,000
1     Melvin     Scott   24         77           83
2     Amirah     Haley   22         92           67
3     Gerard     Mills   19     78,000           72
4        Amy    Grimes   23         91           81

In [52]:
exam_df[['math_score', 'french_score']].dtypes

math_score      object
french_score    object
dtype: object

In [55]:
exam_df = pd.read_csv('exam_review.csv',
                     sep='>',
                     decimal=',')

# Use decimal and/or thousands parameters to ensure such columns are interpreted as integer values

In [56]:
exam_df

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18        68.0          75.0
1     Melvin     Scott   24        77.0          83.0
2     Amirah     Haley   22        92.0          67.0
3     Gerard     Mills   19        78.0          72.0
4        Amy    Grimes   23        91.0          81.0

In [57]:
exam_df[['math_score', 'french_score']].dtypes

math_score      float64
french_score    float64
dtype: object

In [58]:
exam_df = pd.read_csv('exam_review.csv',
                     sep='>',
                     thousands=',')

In [59]:
exam_df

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18       68000         75000
1     Melvin     Scott   24          77            83
2     Amirah     Haley   22          92            67
3     Gerard     Mills   19       78000            72
4        Amy    Grimes   23          91            81

In [60]:
exam_df = pd.read_csv('exam_review.csv',
                     sep='>',
                     decimal=',')

In [61]:
exam_df

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18        68.0          75.0
1     Melvin     Scott   24        77.0          83.0
2     Amirah     Haley   22        92.0          67.0
3     Gerard     Mills   19        78.0          72.0
4        Amy    Grimes   23        91.0          81.0

In [62]:
# Excluding specific rows

exam_df = pd.read_csv('exam_review.csv',
                     sep='>',
                     skiprows=2)

# Skipping specific rows in a file

In [63]:
exam_df

   Melvin   Scott  24      77  83
0  Amirah   Haley  22      92  67
1  Gerard   Mills  19  78,000  72
2     Amy  Grimes  23      91  81

In [65]:
exam_df = pd.read_csv('exam_review.csv',
                     sep='>',
                      decimal=',',
                     skiprows=[1,3])

# Since the header in this case is considered the first row, we can skip reading data rows 1 and 3.

In [66]:
exam_df

  first_name last_name  age  math_score  french_score
0     Melvin     Scott   24        77.0            83
1     Gerard     Mills   19        78.0            72
2        Amy    Grimes   23        91.0            81

In [67]:
# Skipping blank lines

exam_df = pd.read_csv('exam_review.csv',
                     sep='>',
                     skip_blank_lines=False)

# Skip_blank_lines parameter is set to True, so blank lines are skipped while we read files.
# If the parameter is set to false, then every blank line will be loaded with NaN values into the DataFrame.

In [68]:
exam_df

  first_name last_name   age math_score french_score
0        Ray    Morley  18.0     68,000       75,000
1     Melvin     Scott  24.0         77           83
2     Amirah     Haley  22.0         92           67
3        NaN       NaN   NaN        NaN          NaN
4     Gerard     Mills  19.0     78,000           72
5        Amy    Grimes  23.0         91           81

In [73]:
# Loading specific columns using usecols parameter

exam_df = pd.read_csv('exam_review.csv',
                     usecols=['first_name', 'last_name', 'age'],
                     sep='>')
# Corresponding to column index or column names

In [74]:
exam_df

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23

In [75]:
exam_df = pd.read_csv('exam_review.csv',
                     usecols=[0, 1, 2],
                     sep='>')
# Corresponding to column position

In [76]:
exam_df

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23

In [77]:
# Using a Series instead of a Dataframe
# If the parsed data only contains one column we can return a Series by setting the squeeze parameter to True.

In [78]:
exam_test_1 = pd.read_csv('exam_review.csv',
                         sep='>',
                         usecols=['last_name'])

In [79]:
exam_test_1

  last_name
0    Morley
1     Scott
2     Haley
3     Mills
4    Grimes

In [80]:
type(exam_test_1)

pandas.core.frame.DataFrame

In [81]:
exam_test_2 = pd.read_csv('exam_review.csv',
                         sep='>',
                         usecols=['last_name'],
                         squeeze=True)

/tmp/ipykernel_4364/490358522.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  exam_test_2 = pd.read_csv('exam_review.csv',

In [82]:
exam_test_2

0    Morley
1     Scott
2     Haley
3     Mills
4    Grimes
Name: last_name, dtype: object

In [83]:
type(exam_test_2)

pandas.core.series.Series

In [84]:
# Save to CSV file

In [85]:
# We can save our DataFrame asa CSV file.

In [86]:
exam_df

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23

In [87]:
# We can simply generate a CSV string from our DataFrame:

exam_df.to_csv()

',first_name,last_name,age\n0,Ray,Morley,18\n1,Melvin,Scott,24\n2,Amirah,Haley,22\n3,Gerard,Mills,19\n4,Amy,Grimes,23\n'

In [88]:
# Or specify a file path where to save our generated CSV Code.

In [90]:
exam_df.to_csv('out.csv')

In [91]:
pd.read_csv('out.csv')

   Unnamed: 0 first_name last_name  age
0           0        Ray    Morley   18
1           1     Melvin     Scott   24
2           2     Amirah     Haley   22
3           3     Gerard     Mills   19
4           4        Amy    Grimes   23

In [92]:
exam_df.to_csv('out.csv',
              index=None)

In [93]:
pd.read_csv('out.csv')

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23